In [1]:
import pandas as pd

Como os arquivos já bem menores, utilizei diretamente o pandas.

In [2]:
dfFunc = pd.read_csv('funcionariosribeirao.csv')

Importei o arquivo com as configurações padrões.

In [3]:
dfFunc.head(5)

   Unnamed: 0                               Funcionario   Salario
0           5  ACACIO JOSE DAMASCENO                      3330.28
1           6  ADA CRISTIANI FERREIRA                     5931.76
2           7  ADAILTON GERALDO SELEGATO VICENTE          4022.28
3           8  ADALBERTO GONZAGA DA SILVA                 2535.07
4           9  ADALGISA APARECIDA ZANAROTTI PEREIRA      19870.97

Pedi pra ver o começo do arquivo e notei que foi salvo o index do dataframe anterior como uma coluna.

In [3]:
dfFunc = dfFunc.drop(['Unnamed: 0', 'Salario'], axis=1)

Então eu exclui a coluna que citei e mais a salário, já que não vou usa-la também.

In [4]:
dfAux = pd.read_csv('auxilioribeirao.csv')

Importei o outro arquivo.

In [5]:
dfAux.head(5)

   Unnamed: 0                NOME BENEFICIÁRIO  NOME MUNICÍPIO VALOR BENEFÍCIO
0       90036             AARON FERREIRA NOBRE  RIBEIRAO PRETO          600,00
1       90037  ABADIA DE LOURDES CAITANO GOMES  RIBEIRAO PRETO          600,00
2       90038          ABADIA DOS REIS MARTINS  RIBEIRAO PRETO          600,00
3       90039   ABADIA SOUZA SANT ANA DO CARMO  RIBEIRAO PRETO          600,00
4       90040           ABDAO CORREIA DE MOURA  RIBEIRAO PRETO          600,00

Mesmo problema do outro.

In [5]:
dfAux = dfAux.drop(['Unnamed: 0', 'NOME MUNICÍPIO', 'VALOR BENEFÍCIO'], axis=1)

Excluí também o index antigo e outras colunas que não vou usar.

In [6]:
dfAux = dfAux.rename(columns={'NOME BENEFICIÁRIO':'Funcionario'})

Renomei a coluna, pois para fazer a comparação, as duas colunas comparadas devem ter o mesmo nome.

In [7]:
dfFunc.sample(5)

                                   Funcionario
7673  SIMONE DEMARTINI CARVALHO
5899  MATHEUS GONCALVES DOS REIS
7719  SOLANGE OSEAS ANTONIO
7333  SANDRA APARECIDA DE PAIVA BINATO
6202  NEIVA DA SILVA DIAS DE PAULA

In [8]:
dfAux.sample(5)

                           Funcionario
59128             MARCELO FELONI GOMES
93779  WELLITON DA CONCEICAO DE ARAUJO
81183     ROSANGELA SOARES DE OLIVEIRA
2015             ALAN PATRICK DA VEIGA
36608            GUSTAVO LISBOA GRITTI

In [9]:
dfAux.dtypes

Funcionario    object
dtype: object

In [10]:
dfFunc.dtypes

Funcionario    object
dtype: object

Pedi para ver exemplos de cada dataframe e os tipos de dados para ver se estavam de acordo.

In [11]:
dfFunc['Funcionario'].unique()

array(['ACACIO JOSE DAMASCENO                   ',
       'ADA CRISTIANI FERREIRA                  ',
       'ADAILTON GERALDO SELEGATO VICENTE       ', ...,
       'ZULEIDE MARIA DA SILVA CARVALHO         ', nan,
       '08/07/2020 14:39:54'], dtype=object)

In [12]:
dfAux['Funcionario'].unique()

array(['AARON FERREIRA NOBRE', 'ABADIA DE LOURDES CAITANO GOMES',
       'ABADIA DOS REIS MARTINS', ..., 'ZULMIRA APARECIDA FRANCISCO',
       'ZULMIRA INICIO DA CARVALHO', 'ZULMIRA OLIVEIRA MARTINS'],
      dtype=object)

Fui procurar por espaços extras nas linhas das colunas Funcionario e acabei notando que existe um NaN e uma data e horário no dataframe dfFunc, que poderia me atrapalhar.

In [13]:
dfFunc.tail(10)

                                   Funcionario
8461  ZILDA DE FATIMA GIROTO PONTES
8462  ZILDA DE OLIVEIRA NERY
8463  ZILDA TEIXEIRA MARINHO
8464  ZILDENE MARIA DA SILVA OLIVEIRA
8465  ZILDETE MARIA DA SILVA MOURA
8466  ZULEIDE GRANCE CAVALHEIRO
8467  ZULEIDE MARIA DA SILVA CARVALHO
8468                                       NaN
8469                                       NaN
8470                       08/07/2020 14:39:54

Confirmado aqui.

In [14]:
dfFunc = dfFunc.drop([8468, 8469, 8470])

Excluí as linhas.

In [15]:
dfFunc.tail(10)

                                   Funcionario
8458  ZILDA APARECIDA MAIA
8459  ZILDA APARECIDA SIMIONATO BIDOIA
8460  ZILDA CONCEICAO PEREIRA
8461  ZILDA DE FATIMA GIROTO PONTES
8462  ZILDA DE OLIVEIRA NERY
8463  ZILDA TEIXEIRA MARINHO
8464  ZILDENE MARIA DA SILVA OLIVEIRA
8465  ZILDETE MARIA DA SILVA MOURA
8466  ZULEIDE GRANCE CAVALHEIRO
8467  ZULEIDE MARIA DA SILVA CARVALHO

Agora, sim.

In [18]:
dfFunc['Funcionario'] = dfFunc['Funcionario'].map(str.strip)

E excluí os espaços extras.

In [20]:
dfFunc['Funcionario'].unique()

array(['ACACIO JOSE DAMASCENO', 'ADA CRISTIANI FERREIRA',
       'ADAILTON GERALDO SELEGATO VICENTE', ...,
       'ZILDETE MARIA DA SILVA MOURA', 'ZULEIDE GRANCE CAVALHEIRO',
       'ZULEIDE MARIA DA SILVA CARVALHO'], dtype=object)

Lindo.

In [21]:
dfMerged = dfFunc.merge(dfAux, on='Funcionario')

Criei um novo dataframe com o resultado da fusão entre os dois dataframes. Da forma que foi usado, ele geraria o dataframe apenas com os nomes que se repetiam na coluna Funcionario.

In [22]:
dfMerged.sample(5)

                    Funcionario
86           FABIANO DOS SANTOS
279            VIVIANE DA SILVA
207   MONICA CAINELI DOS SANTOS
15               ANA PAULA DIAS
235  RENATA APARECIDA GONCALVES

Um exemplo para ver se funcionou.

In [ ]:
dfMerged.to_csv('funcrpaux.csv', encoding ='utf8')

Salvo.